In [10]:
import pandas as pd
import numpy as np
labels=['a','b','c','d']
list = [1,2,3,4]
dict = {'a':100,'b':200,'c':300,'d':400}
series=pd.Series(list,index=labels)
print(series)
series2=pd.Series(dict)
series2

a    1
b    2
c    3
d    4
dtype: int64

a    100
b    200
c    300
d    400
dtype: int64

DataFrame Creation

In [43]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df1 = pd.DataFrame(data,index = ['a','b','c','d'])
print(df)

       a   b         c      d
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [44]:
data = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2 = pd.DataFrame(data,columns=['a','b','c','d'])
print(df)

       a   b         c      d
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [45]:
print(df2[['a', 'c']])

       a         c
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [46]:
df1["Job"]=["Doctor","Engineer","Scientist","Teacher"]

In [47]:
df1

    Name  Age      City  Salary        Job
a   John   28  New York   65000     Doctor
b   Anna   34     Paris   70000   Engineer
c  Peter   29    Berlin   62000  Scientist
d  Linda   42    London   85000    Teacher

In [48]:
# df1 = df1.drop("a",axis=0)
# df1

In [49]:
df1.loc["b"]

Name          Anna
Age             34
City         Paris
Salary       70000
Job       Engineer
Name: b, dtype: object

In [52]:
df1.loc[["a","b"]]

   Name  Age      City  Salary       Job
a  John   28  New York   65000    Doctor
b  Anna   34     Paris   70000  Engineer

In [53]:
df1.loc[["a","b"]][["Salary","Job"]]

   Salary       Job
a   65000    Doctor
b   70000  Engineer

In [54]:
df1

    Name  Age      City  Salary        Job
a   John   28  New York   65000     Doctor
b   Anna   34     Paris   70000   Engineer
c  Peter   29    Berlin   62000  Scientist
d  Linda   42    London   85000    Teacher

In [61]:
df1[df1["Age"] == 28]

   Name  Age      City  Salary     Job
a  John   28  New York   65000  Doctor

In [62]:
df1[df1["Age"] > 28]

    Name  Age    City  Salary        Job
b   Anna   34   Paris   70000   Engineer
c  Peter   29  Berlin   62000  Scientist
d  Linda   42  London   85000    Teacher